<?php
// Δόξα σοι ὁ Θεὸς ἡμῶν, δόξα σοι.
// Сла́ва тебѣ̀ бж҃е на́шъ, сла́ва тебѣ̀.
// Glory to Thee, our God, glory to Thee.
    
    
include_once("csl_utils.php");

// We NEED word length in occurences, even though it impacts size & performance
// this makes possible to normalize words, not only й but variants of i with . and .., ou with narrow and normal o and whatever else can be found
//  position is now pos | size << 24, since pos is hopefully always less than 16000000 and word size way less than 256
// we'll use plain strlen though, mb_stlen worsens performance too much
// so... we need also search what simplifieds have too many word variants to see what else must be normalized


function csl_normalise($text, $make_lowercase = true)
{
	// decompose diacritics EXCEPT FOR й which is a separate letter, though ponomar.net doesn't think so
    
    if ($make_lowercase)
        return strtr(mb_strtolower($text, 'UTF-8'), array('й' => 'й', 'ї' => 'ї', 'ѷ' => 'ѷ', 'ѐ'=> 'ѐ', 'ѝ' => 'ѝ',
            'оу҆́' => 'ᲂу҆́', 'оу҆̀' => 'ᲂу҆̀', 'оу҆' => 'ᲂу҆', // ONLY when psili is present!
				//'оу' => 'ᲂу'
                    ));
    else
        return strtr($text, array('й' => 'й', 'ї' => 'ї', 'ѷ' => 'ѷ', 'ѐ'=> 'ѐ', 'ѝ' => 'ѝ',
            //  there's no special capital of ᲂ 
            'оу҆́' => 'ᲂу҆́', 'оу҆̀' => 'ᲂу҆̀', 'оу҆' => 'ᲂу҆',  // ONLY when psili is present!
            //'оу' => 'ᲂу',
            'Й' => 'Й', 'Ї' => 'Ї', 'Ѷ' => 'Ѷ', 'Ѐ'=>'Ѐ', 'Ѝ' => 'Ѝ'));
}


function csl_simplify_civil($text)
{
   return strtr(mb_strtolower($text, 'UTF-8'),
              array('ѝ'=> 'и', 'ѐ'=> 'е', 'й' => 'й',  'і' => 'и', 'ї'=> 'и', 'ѡ' => 'о', 'ѣ' => 'е', 'ѧ'=> 'я', 
					mb_chr(768) => '', mb_chr(785) => '', mb_chr(834) =>  '', mb_chr(769) => '', mb_chr(847) => '',
                     mb_chr(776) => '', mb_chr(774) => '', mb_chr(783) => '', mb_chr(787) => '', mb_chr(788) => '',
                     mb_chr(1155) => '', // this is titlo ~
                     mb_chr(1158) => '', mb_chr(1159) => '',));
}


function csl_pre_simplify_book($text)
{
    // try to keep same length
    return strtr(mb_strtolower($text, 'UTF-8'),
              array('-' => ' ', '†' => '   ', '«' => '  ', '»' => '  ', '‑' => '   ',
                   "\xc2\xa0" => '  ', ' ' => '   ', '' => '  ',
                    
                   //chr(141) =>  '',
                    //chr(160) =>  ' ', chr(80) =>  ' ', chr(148) =>  ' ',
                        '꙳' => '   ', '꙾' => '   ', '🕀' => '    ', '🕁' => '    ', '🕂' => '    ', '🕃' => '    ', '🕅'  => '    '));
}

    

function csl_make_slavoniser_word_map($in_text, &$w_map)
{
    if (!is_array($w_map))
        return;
    
    if (empty($in_text))
        return;
    
    $text = csl_pre_simplify_book($in_text);
    unset($in_text);
    
    $separators = csl_get_separators();
    
    $word = strtok($text, $separators);
    
    $pos = 0;

    while ($word !== false)
    {
        if ($word == '')
            continue;
        
        // get word pos here
        $pos = strpos($text, $word, $pos);
        $len = strlen($word);
        
        // only now modify й since it's in-word and changes its length
        $word = csl_normalise($word, false); // already lowercased in pre_simplify
        
        if (!isset($w_map[$word]))
        {
            $w_map[$word] = array(csl_simplify_word($word), 1);
        }
        else
        {
            $w_map[$word][1] += 1;
        }
        
        $pos = $pos + $len;
        
        $word = strtok($separators);
    }
    
    strtok('', '');
}
    
    
function csl_make_simplified_word_map($in_text)
{
    if (empty($in_text))
        return array();
	
    $text = csl_pre_simplify_book($in_text);
    
    unset($in_text);
    
    $word_map = array();
    
    $separators = csl_get_separators();
    
    $word = strtok($text, $separators);
    
    $pos = 0;

    while ($word !== false)
    {
        if ($word == '')
            continue;
        
        // get word pos here
        $pos = strpos($text, $word, $pos);
        $len = strlen($word);
        
        // only now modify й since it's in-word and changes its length
        $word = csl_normalise($word, false); // already lowercased in pre_simplify
        
        if (!isset($word_map[$word]))
        {
            $word_map[$word] = array(csl_simplify_word($word), $pos,  $len);
        }
        else
        {
            $word_map[$word][] = $pos;
            $word_map[$word][] = $len;
        }
        
        $pos = $pos + $len;
        
        $word = strtok($separators);
    }
    
    strtok('', '');
    
    return $word_map;
}





function csl_simplify_word($csl)
{
    if (empty($csl))
        return '';
    
    $replace = array(
                     // Perhaps there's a better way to convert Slavonic numbers than just searching
                     // over a list of {every number up to 500 + several larger ones that
                     // are known to exist in the texts}.
                     // But we need to differentiate them with titlo words along the way
                     // and there are several rather abmigous cases.
                     // So simple algorithms like:
                     // 'if it contains a titlo, try to find a fitting titlo word
                     // and if that is not found, use number conversion function'
                     // won't work all the time - small titlo words or word parts will
                     // definitely be found inside numerals, and vise versa,
                     // and we'll get some rather ugly-looking words.
                     // So either it's multi-stage replacement, perhaps
                     // 'long titlo words' then 'numbers' then 'short titlo words'
                     // (and defining proper 'long' and 'short' may prove not quite trivial)
                     // or we try to keep the replacement simple and one-stage - like we do now.
                     // Then the replacements should contain every number we want to convert
                     // and PHP's strtr algorithm will take care of length,
                     // replacing longer strings first (and length in bytes it uses works OK).
                     // So far, this long and not exactly beautiful-looking list of replacements
                     // seems to be working and correctly simplifying & converting to Civil letters
                     // or Arabic numbers, never mixing them. We must keep watching out for errors though.
                     
                     
                     // bigger number titlos - at least some
                     '҂зрк҃а'=>'7121', '҂зум҃ѕ'=>'7446',
                     '҂аѱ҃ѳ'=>'1709', '҂аѿч҃г'=>'1893',
                     '҂ар҃д'=>'1104', '҂ахѻ҃є'=>'1675',
                     '҂а҃ц҃ч҃а҃'=>'1991', '҂ацз҃і'=>'1917', '҂ацл҃и'=>'1938', '҂ацп҃а'=>'1981', '҂ацп҃д'=>'1984', '҂ацч҃з'=>'1997', '҂ацч҃ѕ'=>'1996',
                     '҂ац҃п'=>'1980', '҂ац҃ѻ'=>'1970',
                     '҂а҃ф'=>'1500', '҂ѕч҃а'=>'6091',
                     '҂а҃ѕ'=>'1006',
                     '҂а'=>'1000', '҂з'=>'7000', '҂ѕ҃'=>'6000', 'сн҃ѳ'=> '259',
                     'фа҃і'=>'511', 'уа҃і'=>'411', 'та҃і'=>'311', 'са҃і'=>'211', 'ра҃ї'=>'111',  'ра҃і'=>'111',
                     'рв҃і'=>'112', 'рв҃ї'=>'112', 'св҃і'=>'212', 'тв҃і'=>'312', 'ув҃і'=>'412', 'фв҃і'=>'512',
                     'сг҃і'=>'213', 'сг҃ї'=>'213', 'рг҃і'=>'113', 'рг҃ї'=>'113', 'тг҃і'=>'313', 'уг҃і'=>'413', 'фг҃і'=>'513',
                     
                     'сч҃ѕ'=>'296', 'рл҃є'=>'235', 'рм҃ѳ'=>'149', 'рм҃ѕ'=>'146', 'сѻ҃є'=>'275', 'рє҃і'=>'115', 'рм҃д'=>'144',
                     'рд҃і'=>'114', 'рѕ҃і'=>'116', 'рз҃і'=>'117', 'ри҃і'=>'118', 'рѳ҃і'=>'119', 'рк҃а'=>'221', 'рк҃в'=>'222',
                     'рк҃г'=>'123', 'рк҃д'=>'124', 'рк҃є'=>'125', 'рк҃ѕ'=>'126', 'рк҃з'=>'127', 'рк҃и'=>'128', 'рк҃ѳ'=>'129',
                     'рл҃а'=>'131', 'рм҃в'=>'142', 'рл҃в'=>'132', 'рл҃г'=>'133', 'рл҃д'=>'134', 'рл҃ѕ'=>'136', 'рл҃з'=>'137',
                     'рл҃и'=>'138','рл҃ѳ'=>'139','рм҃а'=>'141','рм҃г'=>'143','сч҃в'=>'292','рм҃є'=>'145','рм҃з'=>'147','рм҃и'=>'148',
                     'рн҃а'=>'151','тк҃ѳ'=>'329','рн҃в'=>'152', 'рн҃г'=>'153','рн҃д'=>'154','рн҃є'=>'155', 'рн҃ѕ'=>'156','рн҃з'=>'157',
                     'рн҃и'=>'158', 'рн҃ѳ'=>'159','рѯ҃а'=>'161','рѯ҃в'=>'162','рѯ҃г'=>'163','рѯ҃д'=>'164','рѯ҃є'=>'165','рѯ҃ѕ'=>'166',
                     'рѯ҃з'=>'167', 'рѯ҃и'=>'168','рѯ҃ѳ'=>'169', 'рѻ҃а'=>'171','рѻ҃в'=>'172','рѻ҃г'=>'173', 'рѻ҃д'=>'174','рѻ҃є'=>'175',
                     'рѻ҃ѕ'=>'176', 'рѻ҃з'=>'177', 'рѻ҃и'=>'178', 'рѻ҃ѳ'=>'179','рп҃а'=>'181', 'рп҃в'=>'182','рп҃г'=>'183', 'рп҃д'=>'184',
                     'рп҃є'=>'185', 'рп҃ѕ'=>'186','рп҃з'=>'187','рп҃и'=>'188', 'рп҃ѳ'=>'189','рч҃а'=>'191','рч҃в'=>'192','рч҃г'=>'193',
                     'рч҃д'=>'194', 'рч҃є'=>'195','рч҃ѕ'=>'196','рч҃з'=>'197', 'рч҃и'=>'198', 'рч҃ѳ'=>'199', 'р҃ѻ'=>'170',
                     
                     'сд҃і'=>'214','сє҃і'=>'215','сѕ҃і'=>'216','сз҃і'=>'217','си҃і'=>'218','сѳ҃і'=>'219','ск҃а'=>'221','ск҃в'=>'222',
                     'ск҃г'=>'223','тк҃є'=>'325','ск҃д'=>'224','ск҃є'=>'225','ск҃ѕ'=>'226','ск҃з'=>'227','ск҃и'=>'228','ск҃ѳ'=>'229',
                     'сл҃а'=>'231','сл҃в'=>'232','сл҃г'=>'233', 'сл҃д'=>'234','сл҃є'=>'235','сл҃ѕ'=>'236','сл҃з'=>'237','сл҃и'=>'238',
                     'сл҃ѳ'=>'239','см҃а'=>'241','см҃в'=>'242','см҃г'=>'243','см҃д'=>'244','см҃є'=>'245','см҃ѕ'=>'246','см҃з'=>'247',
                     'см҃и'=>'248','см҃ѳ'=>'249','сн҃в'=>'252','сн҃г'=>'253','сн҃д'=>'254','сн҃є'=>'255','сн҃ѕ'=>'256','сн҃з'=>'257',
                     'сн҃и'=>'258','сн҃ѳ'=>'259','сѯ҃а'=>'261','сѯ҃в'=>'262','сѯ҃г'=>'263','сѯ҃д'=>'264','сѯ҃є'=>'265','сѯ҃ѕ'=>'266',
                     'сѯ҃з'=>'267','сѯ҃и'=>'268','сѯ҃ѳ'=>'269','сѻ҃а'=>'271','сѻ҃в'=>'272','сѻ҃г'=>'273','сѻ҃д'=>'274', 
                     'тд҃і'=>'314','сѻ҃ѕ'=>'276','сѻ҃з'=>'277','сѻ҃и'=>'278','сѻ҃ѳ'=>'279','сп҃а'=>'281', 'сп҃в'=>'282','сп҃г'=>'283',
                     'сп҃д'=>'284','сп҃є'=>'285','сп҃ѕ'=>'286','сп҃з'=>'287','сп҃и'=>'288','сп҃ѳ'=>'289', 'сч҃а'=>'291','сч҃г'=>'293',
                     'сч҃д'=>'294','сч҃є'=>'295','сч҃з'=>'297','сч҃и'=>'298','сч҃ѳ'=>'299',

					// 'сн҃а'=>'251', usually NOT a number though context dependent.
                    // (and thus can't be always correctly identified without AI)
                    // in any case it's better to be wrong on the word side, not number side
 
                     'тє҃і'=>'315','тѕ҃і'=>'316','тз҃і'=>'317','ти҃і'=>'318','тѳ҃і'=>'319','тк҃а'=>'321','тк҃в'=>'322','тк҃г'=>'323',
                     'тк҃д'=>'324','тк҃ѕ'=>'326','тк҃з'=>'327','тк҃и'=>'328','тл҃а'=>'331','тл҃в'=>'332','тл҃г'=>'333','тл҃д'=>'334',
                     'тл҃є'=>'335','тл҃ѕ'=>'336','тл҃з'=>'337','тл҃и'=>'338','тл҃ѳ'=>'339','тм҃а'=>'341','тм҃в'=>'342','тм҃г'=>'343',
                     'тм҃д'=>'344','тм҃є'=>'345','тм҃ѕ'=>'346','тм҃з'=>'347','тм҃и'=>'348','тм҃ѳ'=>'349','тн҃а'=>'351','тн҃в'=>'352',
                     'тн҃г'=>'353','тн҃д'=>'354','тн҃є'=>'355','тн҃ѕ'=>'356','тн҃з'=>'357','тн҃и'=>'358','тн҃ѳ'=>'359','тѯ҃а'=>'361',
                     'тѯ҃в'=>'362','тѯ҃г'=>'363','тѯ҃д'=>'364','тѯ҃є'=>'365','тѯ҃ѕ'=>'366','тѯ҃з'=>'367','тѯ҃и'=>'368','тѯ҃ѳ'=>'369',
                     'тѻ҃а'=>'371','тѻ҃в'=>'372','тѻ҃г'=>'373','тѻ҃д'=>'374','тѻ҃є'=>'375','тѻ҃ѕ'=>'376','тѻ҃з'=>'377','тѻ҃н'=>'378',
                     'тѻ҃и'=>'378','тѻ҃ѳ'=>'379','тп҃а'=>'381','тп҃в'=>'382','тп҃г'=>'383','тп҃д'=>'384','тп҃є'=>'385','тп҃ѕ'=>'386',
                     'тп҃з'=>'387','тп҃и'=>'388','тп҃ѳ'=>'389','тч҃а'=>'391','тч҃в'=>'392','тч҃г'=>'393','тч҃д'=>'394','тч҃є'=>'395',
                     'тч҃ѕ'=>'396','тч҃з'=>'397','тч҃и'=>'398','тч҃ѳ'=>'399','уа҃і'=>'411','ув҃і'=>'412','уг҃і'=>'413','уд҃і'=>'414',
                     'ує҃і'=>'415','уѕ҃і'=>'416','уз҃і'=>'417','уи҃і'=>'418','уѳ҃і'=>'419','ук҃а'=>'421','ук҃в'=>'422','ук҃г'=>'423',
                     'ук҃д'=>'424','ук҃є'=>'425','ук҃ѕ'=>'426','ук҃з'=>'427','ук҃и'=>'428','ук҃ѳ'=>'429','ул҃а'=>'431','ул҃в'=>'432',
                     'ул҃г'=>'433','ул҃д'=>'434','ул҃є'=>'435','ул҃ѕ'=>'436','ул҃з'=>'437','ул҃и'=>'438','ул҃ѳ'=>'439','ум҃а'=>'441',
                     'ум҃в'=>'442','ум҃г'=>'443','ум҃д'=>'444','ум҃ѕ'=>'446','ум҃з'=>'447','ум҃и'=>'448','ум҃ѳ'=>'449','ун҃а'=>'451',
                     'ун҃в'=>'452','ун҃г'=>'453', 'ун҃д'=>'454','ун҃є'=>'455','ун҃ѕ'=>'456','ун҃з'=>'457','ун҃и'=>'458','ун҃ѳ'=>'459',
                     'уѯ҃а'=>'461','уѯ҃в'=>'462','уѯ҃г'=>'463','уѯ҃д'=>'464','уѯ҃є'=>'465','уѯ҃ѕ'=>'466','уѯ҃з'=>'467','уѯ҃и'=>'468',
                     'уѯ҃ѳ'=>'469','уѻ҃а'=>'471','уѻ҃в'=>'472','уѻ҃г'=>'473','уѻ҃д'=>'474','уѻ҃є'=>'475','уѻ҃ѕ'=>'476','уѻ҃з'=>'477',
                     'уѻ҃и'=>'478','уѻ҃ѳ'=>'479','уп҃а'=>'481','уп҃в'=>'482','уп҃г'=>'483','уп҃д'=>'484','уп҃є'=>'485','уп҃ѕ'=>'486',
                     'уп҃з'=>'487','уп҃и'=>'488','уп҃ѳ'=>'489','уч҃а'=>'491','уч҃в'=>'492','уч҃г'=>'493','уч҃д'=>'494','уч҃є'=>'495',
                     'уч҃ѕ'=>'496','уч҃з'=>'497','уч҃и'=>'498','уч҃ѳ'=>'499','тн҃е'=>'355','хѻ҃и'=>'678','ум҃є'=>'445','фа҃і'=>'511',
                     'фв҃і'=>'512','фг҃і'=>'513','фд҃і'=>'514','фє҃і'=>'515','фѕ҃і'=>'516','фз҃і'=>'517','фи҃і'=>'518','фѳ҃і'=>'519',
                     'фк҃а'=>'521','фк҃в'=>'522','фк҃г'=>'523','фк҃д'=>'524','фк҃є'=>'525','фк҃ѕ'=>'526','фк҃з'=>'527','фк҃и'=>'528',
                     'фк҃ѳ'=>'529','фл҃а'=>'531','фл҃в'=>'532','фл҃г'=>'533','фл҃д'=>'534','фл҃є'=>'535','фл҃ѕ'=>'536','фл҃з'=>'537',
                     'фл҃и'=>'538','фл҃ѳ'=>'539','фм҃а'=>'541','фм҃в'=>'542','фм҃г'=>'543','є҃ї'=>'15','ѕ҃ї'=>'16','ѳ҃ї'=>'19','с҃ї'=>'210',
                     
                     'р҃а'=>'101','с҃ѻ'=>'270','р҃є'=>'105','с҃м'=>'240','р҃м'=>'140','р҃ѕ'=>'106','р҃в'=>'102','р҃г'=>'103','р҃д'=>'104',
                     'р҃з'=>'107','р҃и'=>'108','р҃ѳ'=>'109','р҃і'=>'110','р҃к'=>'120','р҃л'=>'130','р҃н'=>'150','р҃ѯ'=>'160','р҃п'=>'180',
                     'т҃г'=>'303','т҃ѳ'=>'309','р҃ч'=>'190','т҃д'=>'304','с҃а'=>'201','с҃в'=>'202','с҃г'=>'203','с҃д'=>'204','с҃є'=>'205',
                     'с҃ѕ'=>'206','с҃з'=>'207','с҃и'=>'208','с҃ѳ'=>'209','с҃і'=>'210','с҃к'=>'220','с҃л'=>'230','с҃н'=>'250','с҃ѯ'=>'260',
                     'с҃п'=>'280','с҃ч'=>'290','т҃а'=>'301','т҃в'=>'302','т҃є'=>'304','т҃ѕ'=>'306','т҃з'=>'307','т҃и'=>'308','т҃і'=>'310',
                     'т҃к'=>'320','т҃л'=>'330','т҃м'=>'340','т҃н'=>'350','т҃ѯ'=>'360','т҃ѻ'=>'370','т҃п'=>'380','т҃ч'=>'390','у҃а'=>'401',
                     'у҃в'=>'402','у҃г'=>'403','у҃д'=>'404','у҃є'=>'405','у҃ѕ'=>'406','у҃з'=>'407','у҃и'=>'408','у҃ѳ'=>'409','у҃і'=>'410',
                     'рѯ҃'=>'160','у҃к'=>'420','у҃л'=>'430','у҃м'=>'440','у҃н'=>'450','у҃ѯ'=>'460','у҃ѻ'=>'470','у҃п'=>'480','у҃ч'=>'490',
                     'ф҃а'=>'501','ф҃в'=>'502','ф҃г'=>'503','ф҃д'=>'504','ф҃є'=>'505','ф҃ѕ'=>'506','ф҃з'=>'507','ф҃и'=>'508','ф҃ѳ'=>'509',
                     'ф҃і'=>'510','ф҃к'=>'520','ф҃л'=>'530','ф҃м'=>'540','см҃'=>'240','ун҃'=>'450','ѯ҃е'=>'65','с҃о'=>'270','о҃а'=>'71',
                     'с҃ѯ҃ѕ'=>'266',
                     
                                    
                     
                     'іі'=> 'II', // Latin num
                     
                     // some known titlos
                     'і҆и҃сꙋ́с'=> 'иисус', 'і҆и҃с' => 'иисус',  'І҆с҃'=> 'иисус', 'і҆с҃'=> 'иисус',
                     'хвⷭ҇'=> 'христов', 'хрⷭ҇т' => 'христ', 'х҃с'=> 'христос',
                     'нбⷭ҇' => 'небес',
                     'гдⷭ҇нь'=> 'господень', 'крⷭ҇тобоⷢ҇'=> 'крестобог.', 'гдⷭ'=> 'господ', 
                     'гдⷭ҇рн'=> 'государын', 'гдⷭ҇р'=> 'государ', 'гжⷭ҇'=> 'госпож', 'гпⷭ҇ж'=> 'госпож', 'двⷭ҇т'=> 'девст',
                     'бг҃з'=> 'богоз',
                     'гдⷭ҇в'=> 'господев', 'гдⷭ҇к'=> 'господск', 'гдⷭ҇'=> 'господ',  'прст҃'=> 'пресвят',
                     'ст҃л'=> 'святител', 'ст҃т'=> 'святит',  'ст҃а́ѡ'=> 'святаго', 'ст҃'=> 'свят',
                     'бж҃т'=> 'божест', 'бж҃с'=> 'божес', 'бж҃'=> 'бож', 'бг҃'=> 'бог', 'бз҃'=> 'боз',
                     'нб҃о'=> 'небо', 'н҃бе'=> 'небе',  'нб҃с'=> 'небес', 'нб҃'=> 'неб', 'сл҃нч'=> 'солнеч', 'сл҃н'=> 'солн',
                     'трⷪ҇ц'=> 'троиц', 'трⷪ҇ч'=> 'троич', 'рожⷭ҇т'=> 'рождест', 'спⷭ҇н'=> 'спасен', 'спⷭ҇т'=> 'спаст', 'спⷭ҇'=> 'спас',  'трⷭ҇т'=> 'трисвят',
                     'бжⷭ҇т'=> 'божест', 'ржⷭ҇т'=> 'рождест', 'прⷭ҇но'=> 'присно', 'прⷭ҇н'=> 'присн',
                     'дв҃д'=> 'давид', 'прⷭ҇тол'=> 'престол', 'прⷭ҇то́л'=> 'престол',
                     'бцⷣ'=> 'богородиц', 'дв҃ц'=> 'девиц', 'дв҃ч'=> 'девич', 'дв҃'=> 'дев', 'д҃в'=> 'дев', 'мт҃р'=> 'матер', 'мт҃'=> 'мат', 'бчⷣ'=> 'богородич',
                     'прⷣтч'=> 'предтеч', 'прⷣт'=> 'предт', 'кн҃з'=> 'княз', 'кн҃г'=> 'княг', 'кн҃ж'=> 'княж',
                     'пречⷭ҇тен'=> 'пречестен', 'пречⷭ҇та́ѧ'=> 'пречестная', 'причⷭ҇'=> 'причаст.', 'приⷱ҇'=> 'причаст.',
                     'прчⷭ҇таѧ'=> 'пречистая', 'прчⷭ҇тн'=> 'пречестн','мр҃їа́'=> 'мариа', 'мр҃ї'=> 'мари', 'мр҃і́'=> 'мари',  'мр҃ї'=> 'мари',
                     'прчⷭ҇т'=> 'пречист', 'прⷭ҇та́'=> 'пресвята', 'прⷭ҇ты́'=> 'пресвяты', 'прⷭ҇тѣ́'=> 'пресвяте',
                     'чⷭ҇тен'=> 'честен', 'чтⷭ҇н'=> 'честн', 'чⷭ҇тн'=> 'честн',
                     'чтⷭ҇'=> 'чист', 'чⷭ҇т'=> 'чист', 'цⷭ҇рт'=> 'царст',
                     'цр҃'=> 'цар', 'влⷣчнь'=> 'владычень', 'влⷣк'=> 'владык', 'влⷣц'=> 'владыц', 'влⷣчц'=> 'владычиц', 'влⷣ'=> 'влады',
                     'црⷭ҇'=> 'царс', 'cп҃с'=> 'спас', 'сп҃с'=> 'спас', 'сп҃҃с'=> 'спас',
                     'млрⷭ҇д'=> 'милосерд',  'млⷭ҇т'=> 'милост', 'млⷭ҇рд'=> 'милосерд',
                     'бл҃гочⷭ҇т'=> 'благочест', 'цр҃ц'=> 'цариц',
                     'сщ҃'=> 'свящ', 'блгⷣт'=> 'благодат', 'блгⷭ҇в'=> 'благослов', 'блгⷭ҇л'=> 'благосл', 'блгⷭ҇т'=> 'благост',
                     'ѻч҃єск'=> 'отеческ', 'ѻ҆ч҃ск'=> 'отеческ', 'ѻ҆ч҃ес'=> 'отечес', 'ѻ҆ч҃єс'=> 'отечес',
                     'ѻ҆тч҃с'=> 'отечес', 'ѻ҆т҃ч'=> 'отеч', 'сл҃во'=> 'слово', 'ѻ҆́ч҃ес'=> 'отечес', 'ѻ҆ч҃ь'=> 'отечь', 'ѻ҆́ч҃ь'=> 'отечь',
                     'ѻ҆ц҃а̀'=> 'отца',  'ѻц҃є́в'=> 'отцев', 'ѻ҆́ч҃е'=> 'отче', 'ѻ́ч҃е'=> 'отче', 'ѻ҆ц҃а'=> 'отца', 'ѻч҃е'=> 'отече',
                     'ѻц҃а'=> 'отца', 'ѻ҆ц҃ъ'=> 'отец', 'ѻц҃ъ'=> 'отец', 'ѻ́ч҃'=> 'отч', 'ѻ҆́ч҃'=> 'отч', 'ѻ҆ц҃е́'=> 'отце', 'ѻ҆ц҃ѣ̀'=> 'отце', 'ѻ҆ц҃'=> 'отц',
                      'ѻц҃'=> 'отц', 'ѻ҆ч҃'=> 'отч', 'ѻч҃'=> 'отч',
                     'сн҃'=> 'сын', 'дс҃'=> 'дус', 'дш҃'=> 'душ', 'д́х҃'=> 'дух',  'дх҃'=> 'дух', 'д́ш҃'=> 'душ',
                     'цр҃квь'=> 'церковь', 'цр҃кв'=> 'церкв', 'цр҃к'=> 'церк',
                     'мл҃тв'=> 'молитв', 'мл҃и́'=> 'моли', 'мⷣр'=> 'мудр',
                     'воскрⷭ҇ны'=> 'воскресны', 'воскрⷭ҇нъ'=> 'воскресен', 'воскрⷭ҇нї'=> 'воскресени', 'вскрⷭ҇нї'=> 'воскресени',
                     'воскрⷭ҇н'=> 'воскресн', 'воскрⷭ҇'=> 'воскрес', 'воскⷭ҇р'=> 'воскрес', 'крⷭ҇тл'=> 'крестител', 'крⷭ҇т'=> 'крест',
                     'кр҃с'=> 'крес', 'кр҃ш'=> 'креш', 'кр҃щ'=> 'крещ', 'кр҃л'=> 'кресл',
                     'стрⷭ҇те́р'=>'страстотер', 'стрⷭ҇т'=> 'страст',
                     'а҆рха́гг҃л' => 'архангел',  'а҆́гг҃л' => 'ангел', 'гг҃єл'=> 'нгел',
                     'г҃гл'=> 'нгел', 'нг҃л'=> 'нгел', 'гг҃л'=> 'нгел', 'нг҃л'=> 'нгел', 'гг҃'=> 'нг',
                     'а҆пⷭ҇л' => 'апостол', 'а҆пⷭ҇т' => 'апост', 'апⷭ҇л'=> 'апостол', 'апⷭ҇т'=> 'апост',
                     'пррⷪ҇о́ч'=> 'пророч', 'пррⷪ҇чц' => 'пророчиц', 'пррⷪ҇к'=> 'пророк', 'прⷪ҇рк'=> 'пророк', 'прⷪ҇рц'=> 'пророц', 'пррⷪ҇ц'=> 'пророц',
                     'прⷪ҇рч'=> 'пророч', 'пррⷪ҇ч'=> 'пророч', 'прⷪ҇р'=> 'прор',
                     'мч҃нк'=> 'мученик', 'мчн҃к'=> 'мученик', 'мч҃нц'=> 'мучениц', 'мч҃нч'=> 'мученич',
                     'мчн҃'=> 'мучен', 'мч҃н'=> 'мучен', 'мⷱ҇ꙋ'=> 'муч', 'мч҃'=> 'муч',
                     'і҆и҃л'=> 'израил', 'препⷣб'=> 'преподоб', 'прпⷣб'=> 'преподоб', 'прпⷣн'=> 'преподобн', 'прⷣпб'=> 'преподоб',
                      'і҆єрⷭ҇л'=> 'иерусал', 'і҆ерⷭ҇л'=> 'иерусал', 'бл҃г'=> 'благ', 'бл҃ж'=> 'блаж', 'бл҃з'=> 'блаз', 'прⷣвенъ'=> 'праведен',
                      'проⷦ҇'=> 'пророк', 'см҃рт'=> 'смерт', 'нн҃ѣ'=> 'ныне', 'пл҃т'=> 'плот',
                     'ᲂу҆чт҃л'=> 'учител', 'чт҃л'=> 'чител', 'ᲂу҆чт҃'=> 'учит', 'ᲂу҆ч҃н'=> 'учен', 'ч҃тл'=> 'чител', 'ч҃т'=> 'чит',
                     'чн҃к'=> 'ченик','чн҃ч'=> 'ченич','чн҃ц'=> 'чениц', 'ч҃нк'=> 'ченик','ч҃нч'=> 'ченич','ч҃нц'=> 'чениц', 'чн҃'=> 'чен', 'ч҃н'=> 'чен',
                     'првⷣвн'=> 'праведн', 'првⷣен'=> 'праведен', 'првⷣнъ'=> 'праведен', 'првⷣнк'=> 'праведник', 'првⷣн'=> 'праведн', 'првⷣ' => 'прав',
                     'є҆ѵⷢ҇а́л' => 'евангел',
                     'є҆ѵⷢ҇логиме́нос'=> 'евлогименос', //wrongly used titlo!
                     'є҆ѵⷢ҇л' => 'евангел',   'єѵⷢ҇л' => 'евангел', 'еѵⷢ҇л'=> 'евангел', 'заⷱ҇' => 'зач.', 'глⷡ҇а'=> 'глава', 'глаⷡ҇' => 'глав.',
                     'ѱл҃м'=> 'псалм', 'ѱаⷧ҇' => 'псалом', 'ѱл҃'=> 'псал',
                     'чл҃вѣк'=> 'человек', 'чл҃к'=> 'человек', 'чл҃ц'=> 'человец', 'чл҃в'=> 'челов', 'чл҃ч'=> 'человеч', 'ч҃лв'=> 'челов', 'чл҃о'=> 'чело',
                     'срⷣцъ'=> 'сердец', 'срⷣч'=> 'сердеч', 'срⷣц'=> 'сердц', 'срⷣе'=> 'сердце', 'млⷣнцъ'=> 'младенец', 'млⷣн'=> 'младен',
                     'и҆́мⷬ҇къ'=> 'имярек', 'є҆пⷭ҇кп'=> 'епископ', 'єпкⷭ҇п'=> 'епископ', 'є҆пⷭ҇к'=> 'еписк', 'дш҃е'=> 'душе', 'епⷭ҇кп'=> 'епископ',
                     'епⷭ҇к'=> 'еписк', 'мнⷭ҇т'=> 'монаст', 'гл҃г'=> 'глаг', 'гл҃'=> 'глагол',
                     'мцⷭ҇'=> 'месяц', 'мⷭ҇ц'=> 'месяц', 'мцⷭ'=> 'месяц', 'мⷭ҇ч'=> 'месяч',
                     'стⷯр'=> 'стихир', 'сⷯ'=> 'стих', 'корі́нⷴ҇'=> 'коринф.', 'риⷨ'=> 'рим.',
                     'ндⷧ҇'=> 'недел',  'пнлⷣ'=> 'понедел', 'понлⷣн'=> 'понедельн', 'пнⷣл'=> 'понедел', 'нлⷣ' => 'недел', 'дн҃' => 'ден',
                     //'пѧⷦ҇'=> 'пяток', 'чеⷦ҇'=> 'четверток',
                     'сꙋⷠ҇' => 'субб.', 'пѧⷦ҇' => 'пят.', 'чеⷦ҇' => 'чет.', 'втоⷬ҇'=> 'втор.', 'пнⷣе'=> 'понед.',
                     'триⷤ'=> 'трижды', 'двⷤа'=> 'дважды', 'дваⷤ'=> 'дважды', 'аⷤ'=> 'единожды', 'вⷤ'=> 'дважды', 'гⷤ'=> 'трижды', 'двⷤⷤа'=> 'дважды', 'дⷤ'=> 'четырежды',
                     
                     'ѿѧ̀'=> 'отъя', 'ѿѧ́'=> 'отъя', 'ѿѧ̑'=> 'отъя', 'ѿѧ'=> 'отъя',
                     'ѿи'=> 'отъи', 'ѿи́'=> 'отъи', 'ѿи҆'=> 'отъи',
                     'ѿе'=> 'отъе', 'ѿе́' => 'отъе', 'ѿє҆́' => 'отъе', 'ѿє' => 'отъе', 'ѿє́' => 'отъе',
                     
                     // greek gg, gx and gk
                     'сѷгк' => 'синк','сѵгк'=> 'синк', 'а҆гк' => 'анк', 'пагк' => 'панк', 'трагк' => 'транк', 'є҆гк' => 'енк', 'рагк'=>'ранк',
                     'ло́гг' => 'лонг', 'сѷгг' => 'синг', 'сѵ́гг'=>'синг',  'га́гг' => 'ганг', 'а҆гаѳагг' => 'агафанг', 'є҆рмїнїгг'=> 'ермининг',
                     'расто́ргг'=> 'расторгн', 'еѵа́гг'=>'еванг', 'єѵа́гг'=>'еванг', 'арха́гг'=>'арханг',
                     'вара́гг'=>'варанг', 'ке́гх'=>'кенх', 'кегх'=>'кенх', 'пагх'=>'панх', 'а҆гх'=> 'анх',
                     
                     // Izhitsa is special
                     'ѵ҆́'=> 'и', 'ѵ҆'=> 'и', 'ѷ'=> 'и',
                     mb_chr(1141).mb_chr(768) => 'и',  mb_chr(1141).mb_chr(769) => 'и', mb_chr(1141).mb_chr(785) => 'и', mb_chr(1141).mb_chr(843) => 'и',
                     mb_chr(1141).mb_chr(776) => 'и',  mb_chr(1141).mb_chr(783) => 'и', mb_chr(1141).mb_chr(787) => 'и', mb_chr(1141).mb_chr(787) => 'и',
                     mb_chr(1141) => 'в',
                     
                     // й is й,  ̾ is ъ but only before e я ю
                     'й' => 'й', mb_chr(830).'е' => 'ъе', mb_chr(830).'є' => 'ъе', mb_chr(830).'ѣ' => 'ъе',
                     mb_chr(830).'я' => 'ъя', mb_chr(830).'ѧ' => 'ъя', mb_chr(830).'ꙗ' => 'ъя', mb_chr(830).'ю' => 'ъю',
                     // otherwise remove it
                     mb_chr(830) => '',
                     //mb_chr(1080).mb_chr(785) => 'й',
                     
                     //  remove any accents, breath and dieresis
                     mb_chr(768) => '', mb_chr(785) => '', mb_chr(834) =>  '', mb_chr(769) => '', mb_chr(847) => '',
                     mb_chr(776) => '', mb_chr(774) => '', mb_chr(783) => '', mb_chr(787) => '', mb_chr(788) => '',
                     mb_chr(1155) => '', // this is titlo ~
                     mb_chr(1158) => '', mb_chr(1159) => '',
                     
                     // Slavonic to Civil
                     'оу҆́'=> 'у', 'оу҆̀'=> 'у', 'оу҆' => 'у',
                     'ᲂу҆́'=> 'у', 'ᲂу҆̀'=> 'у', 'ᲂу҆' => 'у',
                     //'оу'=> 'у', don't do this without psili: поучение, благоутробие
                     'є' => 'е', 'ѕ' => 'з', 'і' => 'и', 'ї'=> 'и', 'ѡ' => 'о', 'ѣ' => 'е', 'ѧ'=> 'я', 'ѫ' => 'у', 'ѯ' => 'кс', 'ѱ' => 'пс',
                     'ѳ' => 'ф', 'ѻ' => 'о', 'ѽ' => 'о', 'ѿ'=> 'от', 'ꙋ' => 'у', 'ꙗ'=> 'я', 'ѝ'=> 'и', 'ѐ'=> 'е',
                     
                     '҂'=> '1000*', // ugly fallback for thousands not in the number list above
                     
                     // Lone letter titlos mean no proper word was found, so as a last resort...
                     mb_chr(11744)=> 'б', mb_chr(11745)=> 'в', mb_chr(11746)=> 'г', mb_chr(11747)=> 'д', mb_chr(11748)=> 'ж',
                     mb_chr(11750)=> 'к', mb_chr(11751)=> 'л', mb_chr(11752)=> 'м', mb_chr(11753)=> 'н', mb_chr(11754)=> 'о',
                     mb_chr(11756)=> 'р', mb_chr(11757)=> 'с', mb_chr(11759)=> 'х', mb_chr(11761)=> 'ч', mb_chr(11764)=> 'ф',
                     
                     // these are in fact "separators" and shouldn't be in the word at all
                     // but in case text-splitting algorithm goes wrong... 
                     '꙾' => ' ', ' '=> ' ',

					//'🕅' => 'Марк. гл.:',
                     
                     // low-digit numbers should be processed last
                     // (and that happens because of their short string length of course
                     // not because they're at the end of the list)
                     'ч҃ѳ'=>'99', 'ч҃и'=>'98', 'ч҃з'=>'97', 'ч҃ѕ'=>'96', 'ч҃є'=>'95', 'ч҃д'=>'94', 'ч҃г'=>'93', 'ч҃в'=>'92', 'ч҃а'=>'91', 'ч҃'=>'90',
                     'п҃ѳ'=>'89', 'п҃и'=>'88', 'п҃з'=>'87', 'п҃ѕ'=>'86', 'п҃є'=>'85', 'п҃д'=>'84', 'п҃г'=>'83', 'п҃в'=>'82', 'п҃а'=>'81', 'п҃'=>'80',
                     'ѻ҃ѳ'=>'79', 'ѻ҃и'=>'78', 'ѻ҃з'=>'77', 'ѻ҃ѕ'=>'76', 'ѻ҃є'=>'75', 'ѻ҃д'=>'74', 'ѻ҃г'=>'73', 'ѻ҃в'=>'72', 'ѻ҃а'=>'71', 'ѻ҃'=>'70',
                     'ѯ҃ѳ'=>'69', 'ѯ҃и'=>'68', 'ѯ҃з'=>'67', 'ѯ҃ѕ'=>'66', 'ѯ҃є'=>'65', 'ѯ҃д'=>'64', 'ѯ҃г'=>'63', 'ѯ҃в'=>'62', 'ѯ҃а'=>'61', 'ѯ҃'=>'60',
                     'н҃ѳ'=>'59', 'н҃и'=>'58', 'н҃з'=>'57', 'н҃ѕ'=>'56', 'н҃є'=>'55', 'н҃д'=>'54', 'н҃г'=>'53', 'н҃в'=>'52', 'н҃а'=>'51', 'н҃'=>'50',
                     'м҃ѳ'=>'49', 'м҃и'=>'48', 'м҃з'=>'47', 'м҃ѕ'=>'46', 'м҃є'=>'45', 'м҃д'=>'44', 'м҃г'=>'43', 'м҃в'=>'42', 'м҃а'=>'41', 'м҃'=>'40',
                     'л҃ѳ'=>'39', 'л҃и'=>'38', 'л҃з'=>'37', 'л҃ѕ'=>'36', 'л҃є'=>'35', 'л҃д'=>'34', 'л҃г'=>'33', 'л҃в'=>'32', 'л҃а'=>'31', 'л҃'=>'30',
                     'к҃ѳ'=>'29', 'к҃и'=>'28', 'к҃з'=>'27', 'к҃ѕ'=>'26', 'к҃є'=>'25', 'к҃д'=>'24', 'к҃г'=>'23', 'к҃в'=>'22', 'к҃а'=>'21', 'к҃'=>'20',
                     'з҃і'=>'17', 'з҃ї'=>'17', 'и҃і'=>'18', 'и҃ї'=>'18',
                     'а҃ї'=>'11', 'а҃і'=>'11', 'аі҃'=>'11', 'в҃і'=>'12', 'в҃ї'=>'12', 'ві҃'=>'12', 'г҃і'=>'13', 'г҃ї'=>'13', 'гі҃'=>'11', 'ді҃'=>'14', 'д҃і'=>'14', 'д҃ї'=>'14', 'є҃і'=>'15', 'ѕ҃і'=>'16', 'ѳ҃і'=>'19',
                     
                     'а҃'=>'1', 'в҃'=>'2', 'г҃'=>'3', 'д҃'=>'4', 'д́҃'=>'4', 'є҃'=>'5', 'е҃'=>'5', 'ѕ҃'=>'6', 'з҃'=>'7', 'и҃'=>'8', 'ѳ҃'=>'9', 'і҃'=>'10',
                     'р҃'=>'100', 'с҃'=>'200', 'т҃'=>'300','у҃'=>'400' , 'ф҃'=>'500',
                     );
    
    $result = strtr($csl, $replace);
    
    if (mb_substr($result, -1, 1, 'UTF-8') == 'ъ')
    {
        return mb_substr($result, 0, mb_strlen($result)-1, 'UTF-8');
    }
    else
    {
        return $result;
    }
}
    
    
 
    


?>
